# IsWSVisible

## Description
Returns display status of referenced worksheet.

```pascal
FUNCTION IsWSVisible(worksheet : HANDLE): BOOLEAN;
```

```python
def vs.IsWSVisible(worksheet):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|worksheet|HANDLE|Handle to worksheet.|

## Version
Availability: from VectorWorks9.0

## Category
* Worksheets